---
kind: method
id: M:Autodesk.Revit.DB.FillPattern.GetFillGrids
source: html/d05f4cd1-d5df-093d-693e-545b4250ee29.htm
---
# Autodesk.Revit.DB.FillPattern.GetFillGrids Method

Gets all fill grids in this fill pattern

## Syntax (C#)
```csharp
public IList<FillGrid> GetFillGrids()
```

## Returns
The fill grids.